<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Ρυθμίσεις παράκαμψης φορτωτή</string><string id="BrowserExecutableFolder">Ρύθμιση παραμέτρων της θέσης του εκτελέσιμου φακέλου του προγράμματος περιήγησης</string><string id="BrowserExecutableFolder_Explain">Αυτή η πολιτική ρυθμίζει τις παραμέτρους WebView2 εφαρμογών για να χρησιμοποιήσετε το WebView2 Runtime στην καθορισμένη διαδρομή. Ο φάκελος θα πρέπει να περιέχει τα ακόλουθα αρχεία: msedgewebview2.exe, msedge.dll και ούτω καθεξής.

Για να ορίσετε την τιμή για τη διαδρομή του φακέλου, πληκτρολογήστε το όνομα της τιμής και το συνδυασμό τιμής. Ορίστε το όνομα της τιμής στο όνομα του μοντέλου χρήστη της εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμοστεί σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Ρύθμιση παραμέτρων της θέσης του εκτελέσιμου φακέλου του προγράμματος περιήγησης</string><string id="ReleaseChannelPreference">Ορισμός προτιμήσεων σειράς αναζήτησης για το κανάλι κυκλοφορίας</string><string id="ReleaseChannelPreference_Explain">Η προεπιλεγμένη σειρά αναζήτησης καναλιού είναι το Runtime WebView2, το beta, το Dev και Canary.

Για να αντιστρέψετε την προεπιλεγμένη σειρά αναζήτησης, ορίστε αυτή την πολιτική στο 1.

Για να ορίσετε την τιμή για την προτίμηση καναλιού κυκλοφορίας, δώστε ένα όνομα τιμής και ένα ζεύγος τιμών. Ορίστε το όνομα της τιμής στο όνομα του μοντέλου χρήστη της εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμοστεί σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Ορισμός προτιμήσεων σειράς αναζήτησης για το κανάλι κυκλοφορίας</string><string id="ExperimentationAndConfigurationServiceControl">Έλεγχος επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</string><string id="ExperimentationAndConfigurationServiceControl_Explain">H υπηρεσία πειραματισμού και ρυθμίσεων χρησιμοποιείται για την ανάπτυξη ωφέλιμων φορτίων πειραματισμού και ρύθμισης παραμέτρων στον πελάτη.

     Το ωφέλιμο φορτίο πειραματισμού αποτελείται από μια λίστα με τις πρώιμες δυνατότητες που αναπτύσσονται από τη Microsoft με σκοπό τη δοκιμή και την παροχή σχολίων.

     Το ωφέλιμο φορτίο ρύθμισης παραμέτρων αποτελείται από μια λίστα προτεινόμενων ρυθμίσεων που θέλει να αναπτύξει η Microsoft ώστε να βελτιστοποιήσει την εμπειρία χρήστη.

Το ωφέλιμο φορτίο ρύθμισης παραμέτρων μπορεί επίσης να περιλαμβάνει μια λίστα ενεργειών που μπορούν να εκτελεστούν για λόγους συμβατότητας. Για παράδειγμα, το πρόγραμμα περιήγησης μπορεί να παρακάμπτει τη συμβολοσειρά παράγοντα χρήση σε μια τοποθεσία web, αν η συγκεκριμένη τοποθεσία είναι κατεστραμμένη. Κάθε μία από τις ενέργειες αυτές εφαρμόζονται προσωρινά όσο προσπαθεί η Microsoft να λύσει το πρόβλημα σε συνεργασία με τον κάτοχο της τοποθεσίας.

     Αν ορίσετε αυτή την πολιτική σε &quot;FullMode&quot;, θα γίνεται λήψη του πλήρους ωφέλιμου φορτίου από την υπηρεσία πειραματισμού και ρυθμίσεων. Σε αυτό περιλαμβάνονται τόσο το ωφέλιμο φορτίο πειραματισμού όσο και το ωφέλιμο φορτίο ρύθμισης παραμέτρων.

     Αν ορίσετε αυτή την πολιτική σε &quot;ConfigurationsOnlyMode&quot;, θα κατεβαίνει μόνο το ωφέλιμο φορτίο ρύθμισης παραμέτρων.

     Αν ορίσετε αυτήν την πολιτική σε &quot;RestrictedMode&quot;, θα διακοπεί πλήρως η επικοινωνία με την υπηρεσία πειραματισμού και ρυθμίσεων.Η Microsoft δεν συνιστά αυτήν τη ρύθμιση.

     Αν δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, σε μια διαχειριζόμενη συσκευή, η συμπεριφορά στα κανάλια Stable και Beta θα είναι ίδια με τη λειτουργία &quot;ConfigurationsOnlyMode&quot;. Στα κανάλια Canary και Dev η συμπεριφορά είναι ίδια με τη λειτουργία &quot;FullMode&quot;.

     Αν δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, σε μια μη διαχειριζόμενη συσκευή, η συμπεριφορά θα είναι ίδια με τη λειτουργία &quot;FullMode&quot;.

Αντιστοίχιση επιλογών πολιτικής:

* FullMode (2) = Ανάκτηση ρυθμίσεων παραμέτρων και πειραματισμού

* ConfigurationsOnlyMode (1) = Ανάκτηση μόνο ρυθμίσεων παραμέτρων

* RestrictedMode (0) = Απενεργοποίηση επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων

Χρησιμοποιήστε τις προηγούμενες πληροφορίες κατά τη ρύθμιση των παραμέτρων αυτής της πολιτικής.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Ανάκτηση ρυθμίσεων παραμέτρων και πειραματισμού</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Ανάκτηση μόνο ρυθμίσεων παραμέτρων</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Απενεργοποίηση επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge έκδοση 97, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge έκδοση 87, Windows 7 ή νεότερη έκδοση</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Προεπιλεγμένες ρυθμίσεις (είναι δυνατή η αντικατάσταση από τους χρήστες)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Έλεγχος επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>